# Дан список кортежей. Написать программу, которая меняет последнее значение элемента кортежей.

list_1 = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]
arr = []
for i in list_1:                    # 1 способ
    i = i[:-1] + (10,)
    arr.append(i)
print(arr)

print([j[:-1] + (10,) for j in list_1])     # 2 способ

